t3ste/Tlg-esp32-photoframe/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# WiFi Configuration
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""
CONFIG_ESP_MAXIMUM_RETRY=5

# HTTP Server Configuration
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# PSRAM Configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SD Card Configuration
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task stack size - Increase for WiFi and HTTP client operations.
# The heavier deep-sleep-wake rotation pipeline (Telegram's TLS/JSON, or
# Storage mode's own orientation-pairing image composition) no longer runs
# on this task - see deep_sleep_wake_task() in main.c, which runs it on its
# own dedicated (12288-byte) task instead of paying for that headroom here
# permanently, on every build, whether it's ever needed or not.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Component config
# All sockets share this pool: HTTP server (10) + optional HTTPS server (4) + their listen/control
# sockets (4) + outgoing connections (Telegram, weather, image URL, OTA). With 16 the pool ran
# dry as soon as a browser held many keep-alive connections (httpd 'error in accept (23)' ==
# ENFILE), which made the frame unreachable and failed its own fetches.
CONFIG_LWIP_MAX_SOCKETS=24
CONFIG_LWIP_MAX_ACTIVE_TCP=24

# Enable deep sleep
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Interrupt Watchdog - Increase timeout for long SPI transfers during e-paper refresh
# Default is 300ms, increase to 1000ms to allow large SPI buffer transfers
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000

# Task Watchdog - Increase timeout for slow SD card writes during image conversion
# Default is 5 seconds, increase to 15 seconds to allow for slow SD card operations
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# Power Management - Enable automatic light sleep and CPU frequency scaling
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y

# ESP-TLS - Allow skipping server certificate verification for HTTPS
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# mbedTLS - allocate through malloc() instead of internal RAM only. A TLS session needs a
# 16 KiB input + 4 KiB output buffer; from internal DRAM alone the HTTPS web UI (opt-in)
# failed sporadically with "mbedtls_ssl_setup returned -0x008D" (out of memory) once the
# heap was fragmented. malloc() sends the big buffer to PSRAM (SPIRAM_USE_MALLOC) and
# falls back between the two; boards without PSRAM behave as before.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y

# mbedTLS - Keep peer certificate for trust-cert endpoint
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y

# mbedTLS certificate bundle - support cross-signed roots. Found live: a
# Google Calendar ICS fetch failed every time with "esp-x509-crt-bundle: No
# matching trusted root certificate found" / "mbedtls_ssl_handshake
# returned -0x3000", even though the URL worked fine from a browser/curl.
# calendar.google.com's chain terminates at "GTS Root R4" (Google Trust
# Services' newer ECDSA root), which is itself cross-signed by the much
# older, near-universally-trusted "GlobalSign Root CA" - exactly the
# scenario this option exists for (standard bundle verification only
# checks whether the chain's own terminal cert is *directly* a trusted
# self-signed root, not whether it's cross-signed by one). Costs ~700
# bytes of heap per the option's own Kconfig help text.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# HTTPS web UI (opt-in, off by default via config_manager - github.com/
# aitjcize/esp32-photoframe#130): esp_https_server plus the two mbedtls
# options its on-device self-signed cert generation needs. Neither symbol
# is on by default even with the rest of TLS-client support already linked
# in for outbound HTTPS (weather/calendar/OTA/Telegram) - see main/https_cert.c.
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_X509_CRT_WRITE_C=y
